app/controllers/document_controller.rb

SELECT * FROM `template_pages` WHERE (`template_pages`.`id` = '83') LIMIT 1
SELECT * FROM `template_fields` WHERE (`template_fields`.`template_page_id` = 83)
---
  def generate
    pos_x = params[:pos_x]
    pos_y = params[:pos_y]
    width = params[:width]
    height = params[:height]
    page_id = params[:page_id]
    font = params[:font]
    size = params[:size]
    color = params[:color]
    grid = params[:grid]
    max_rows = params[:max_rows]
    borders = params[:borders]
    align = params[:align]
    template_asset_id = params[:template_asset_id]
    paper_size = params[:paper_size]
    landscape = params[:landscape]

    #get template pages
    template_page = TemplatePage.find(:first, :conditions => {"id" => page_id})

    res = TemplateField.find(:all, :conditions => ["template_page_id = #{page_id}"])

SELECT * FROM `template_assets` WHERE (`template_assets`.`id` IN (1,2,3,4,5))
---
    doc.define_template(:template, tp.eps_location, :x=> 0, :y => 0)

    #find All Fields
    tfs = TemplateField.find(:all, :include => "template_asset",  :conditions => {"template_page_id" => tp.id})

SELECT * FROM `template_pages` WHERE (`template_pages`.`id` = '70') LIMIT 1
SELECT * FROM `templates` WHERE (`templates`.`id` = 35) LIMIT 1
---
  def choose
    id = params[:id]
    @pages = TemplatePage.find(:all)
    if id.present?
      @page = TemplatePage.find(:first, :conditions => {:id => id})
      @tmpt = Template.find(:first, :conditions => {:id => @page.template_id})

SELECT * FROM `templates` WHERE (`templates`.`name` = 'QLD SRTO')
SELECT * FROM `template_pages` WHERE (`template_pages`.`template_id` = 39)
---
  def save
    #RGhost config
    #RGhost::Config::GS[:path]= 'C:\\Program Files (x86)\\gs\\gs9.05\\bin\\gswin32c.exe'
    landscape = (params[:landscape] == "1")? 1:0;
    papersize = (params[:papersize].blank?)? "a4":params[:papersize];



    #get and save file
    filename = params[:upload][:file].original_filename

    #santize filename
    filename = filename.gsub /^.*(\\|\/)/, ''
    filename = filename.gsub(/[^0-9A-Za-z.\-]/, '_')



    name = filename.sub('.pdf', '')
    template_dir = File.join(RAILS_ROOT, "public/template")
    path = File.join(template_dir, name + '.pdf')
    File.open(path, "wb") { |f| f.write(params[:upload][:file].read)}

    #store in database
    res = Template.find(:all, :conditions => {:name => name})
    if res.length > 0
      for r in res
        pages = TemplatePage.find(:all, :conditions => {:template_id => r.id})