app/controllers/posts_controller.rb

INSERT INTO `posts` (`updated_at`, `title`, `body`, `created_at`) VALUES('2011-06-10 00:37:50', 'swimming is good', 'test', '2011-06-10 00:37:50')
---
  def create
    @post = Post.new(params[:post])

    if @post.save